## Ejercicio 1

Crea una función llamada ejercicio1, que recibe la ruta donde se encuentra un dataset y devuelve una DataFrame con los datos que hay en el dataset. Para comprobar esta función utiliza el dataset `titanic.csv` que se incluye en esta actividad.

In [22]:
import pandas as pd

def ejercicio1(csv_path):
    return pd.read_csv(csv_path)

df_titanic = ejercicio1('titanic.csv')
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Ejercicio 2

Crea otra función llamada ejercicio2. Esta función recibe un único argumento que es un dataframe. En concreto debe recibir el dataframe que se ha obtenido de leer el dataset `titanic.csv`. Esta función devolverá otro dataset que incluya únicamente a los pasajeros menores de 35 años y que viajaban en 3ª clase.

In [17]:
def ejercicio2(df):
    filtro = lambda item: item['Age'] < 35 and item['Pclass'] == 3
    return df[df.apply(filtro, axis=1)]
df_titanic_filtrado = ejercicio2(df_titanic)
df_titanic_filtrado.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,286.000000,286.000000,286.0,286.000000,286.000000,286.000000,286.000000
mean,439.884615,0.272727,3.0,20.676294,0.664336,0.384615,13.376033
std,271.610384,0.446142,0.0,8.626345,1.253453,0.724732,10.202146
min,1.000000,0.000000,3.0,0.420000,0.000000,0.000000,0.000000
25%,195.000000,0.000000,3.0,17.000000,0.000000,0.000000,7.795800
50%,423.500000,0.000000,3.0,22.000000,0.000000,0.000000,8.050000
75%,691.250000,1.000000,3.0,27.000000,1.000000,1.000000,15.850000
max,891.000000,1.000000,3.0,34.500000,5.000000,4.000000,56.495800

## Ejercicio 3

Crea una función llamada ejercicio3, que recibiendo como argumento el dataframe de salida del ejercicio 2, calcule el porcentaje de pasajeros menores de 35 años de 3ª clase que sobrevivieron.

In [30]:
def ejercicio3(df_original):
    df = ejercicio2(df_original)
    filtro = lambda item: item['Survived'] == 1
    df_filtrado = df[df.apply(filtro, axis=1)]
    return (df_filtrado['Survived'].count() / df['Survived'].count()) * 100 # Percentage
ejercicio3(df_titanic)

27.27272727272727

## Ejercicio 4

Implementa una función llamada ejercicio4 que recibiendo el dataframe con los datos del Titanic, devuelva en una tupla el porcentaje de hombres y mujeres que viajaban en el Titanic, redondeados al segundo decimal.

In [27]:
def ejercicio4(df):
    filtro_mujeres = lambda item: item['Sex'] == 'female'
    filtro_hombres = lambda item: item['Sex'] == 'male'

    df_female = df[df.apply(filtro_mujeres, axis=1)]
    percentage_female = (df_female['Sex'].count() / df['Sex'].count()) * 100

    df_male = df[df.apply(filtro_hombres, axis=1)]
    percentage_male = (df_male['Sex'].count() / df['Sex'].count()) * 100

    return round(percentage_male, 2), round(percentage_female, 2)
ejercicio4(df_titanic)

(64.76, 35.24)

## Ejercicio 5


Implementa una función llamada ejercicio5 que recibiendo el dataframe con los datos del Titanic, devuelva en una lista el número de pasajeros que viajaban en 1ª, 2ª y 3ª clase.

In [26]:
def ejercicio5(df):
    filtro_1 = lambda item: item['Pclass'] == 1
    filtro_2 = lambda item: item['Pclass'] == 2
    filtro_3 = lambda item: item['Pclass'] == 3

    df1 = df[df.apply(filtro_1, axis=1)]
    num1 = df1['Pclass'].count()

    df2 = df[df.apply(filtro_2, axis=1)]
    num2 = df2['Pclass'].count()

    df3 = df[df.apply(filtro_3, axis=1)]
    num3 = df3['Pclass'].count()

    return [num1, num2, num3]
ejercicio5(df_titanic)

[216, 184, 491]